ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32660/Libraries/PeriphDrivers/Source/DMA/dma_reva_regs.h
 #define MXC_F_DMA_REVA_INTEN_CH12_POS                       12 /**< INTEN_CH12 Position */
 #define MXC_F_DMA_REVA_INTEN_CH12                           ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTEN_CH12_POS)) /**< INTEN_CH12 Mask */

 #define MXC_F_DMA_REVA_INTEN_CH13_POS                       13 /**< INTEN_CH13 Position */
 #define MXC_F_DMA_REVA_INTEN_CH13                           ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTEN_CH13_POS)) /**< INTEN_CH13 Mask */

 #define MXC_F_DMA_REVA_INTEN_CH14_POS                       14 /**< INTEN_CH14 Position */
 #define MXC_F_DMA_REVA_INTEN_CH14                           ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTEN_CH14_POS)) /**< INTEN_CH14 Mask */

 #define MXC_F_DMA_REVA_INTEN_CH15_POS                       15 /**< INTEN_CH15 Position */
 #define MXC_F_DMA_REVA_INTEN_CH15                           ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTEN_CH15_POS)) /**< INTEN_CH15 Mask */

/**@} end of group DMA_INTEN_Register */

/**
 * @ingroup  dma_registers
 * @defgroup DMA_INTFL DMA_INTFL
 * @brief    DMA Interrupt Register.
 * @{
 */
 #define MXC_F_DMA_REVA_INTFL_CH0_POS                        0 /**< INTFL_CH0 Position */
 #define MXC_F_DMA_REVA_INTFL_CH0                            ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTFL_CH0_POS)) /**< INTFL_CH0 Mask */

 #define MXC_F_DMA_REVA_INTFL_CH1_POS                        1 /**< INTFL_CH1 Position */
 #define MXC_F_DMA_REVA_INTFL_CH1                            ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTFL_CH1_POS)) /**< INTFL_CH1 Mask */

 #define MXC_F_DMA_REVA_INTFL_CH2_POS                        2 /**< INTFL_CH2 Position */
 #define MXC_F_DMA_REVA_INTFL_CH2                            ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTFL_CH2_POS)) /**< INTFL_CH2 Mask */

 #define MXC_F_DMA_REVA_INTFL_CH3_POS                        3 /**< INTFL_CH3 Position */
 #define MXC_F_DMA_REVA_INTFL_CH3                            ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTFL_CH3_POS)) /**< INTFL_CH3 Mask */

 #define MXC_F_DMA_REVA_INTFL_CH4_POS                        4 /**< INTFL_CH4 Position */
 #define MXC_F_DMA_REVA_INTFL_CH4                            ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTFL_CH4_POS)) /**< INTFL_CH4 Mask */

 #define MXC_F_DMA_REVA_INTFL_CH5_POS                        5 /**< INTFL_CH5 Position */
 #define MXC_F_DMA_REVA_INTFL_CH5                            ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTFL_CH5_POS)) /**< INTFL_CH5 Mask */

 #define MXC_F_DMA_REVA_INTFL_CH6_POS                        6 /**< INTFL_CH6 Position */
 #define MXC_F_DMA_REVA_INTFL_CH6                            ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTFL_CH6_POS)) /**< INTFL_CH6 Mask */

 #define MXC_F_DMA_REVA_INTFL_CH7_POS                        7 /**< INTFL_CH7 Position */
 #define MXC_F_DMA_REVA_INTFL_CH7                            ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTFL_CH7_POS)) /**< INTFL_CH7 Mask */

 #define MXC_F_DMA_REVA_INTFL_CH8_POS                        8 /**< INTFL_CH8 Position */
 #define MXC_F_DMA_REVA_INTFL_CH8                            ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTFL_CH8_POS)) /**< INTFL_CH8 Mask */

 #define MXC_F_DMA_REVA_INTFL_CH9_POS                        9 /**< INTFL_CH9 Position */
 #define MXC_F_DMA_REVA_INTFL_CH9                            ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTFL_CH9_POS)) /**< INTFL_CH9 Mask */

 #define MXC_F_DMA_REVA_INTFL_CH10_POS                       10 /**< INTFL_CH10 Position */
 #define MXC_F_DMA_REVA_INTFL_CH10                           ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTFL_CH10_POS)) /**< INTFL_CH10 Mask */

 #define MXC_F_DMA_REVA_INTFL_CH11_POS                       11 /**< INTFL_CH11 Position */
 #define MXC_F_DMA_REVA_INTFL_CH11                           ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTFL_CH11_POS)) /**< INTFL_CH11 Mask */

 #define MXC_F_DMA_REVA_INTFL_CH12_POS                       12 /**< INTFL_CH12 Position */
 #define MXC_F_DMA_REVA_INTFL_CH12                           ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTFL_CH12_POS)) /**< INTFL_CH12 Mask */

 #define MXC_F_DMA_REVA_INTFL_CH13_POS                       13 /**< INTFL_CH13 Position */
 #define MXC_F_DMA_REVA_INTFL_CH13                           ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTFL_CH13_POS)) /**< INTFL_CH13 Mask */

 #define MXC_F_DMA_REVA_INTFL_CH14_POS                       14 /**< INTFL_CH14 Position */
 #define MXC_F_DMA_REVA_INTFL_CH14                           ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTFL_CH14_POS)) /**< INTFL_CH14 Mask */

 #define MXC_F_DMA_REVA_INTFL_CH15_POS                       15 /**< INTFL_CH15 Position */
 #define MXC_F_DMA_REVA_INTFL_CH15                           ((uint32_t)(0x1UL << MXC_F_DMA_REVA_INTFL_CH15_POS)) /**< INTFL_CH15 Mask */

/**@} end of group DMA_INTFL_Register */

/**
 * @ingroup  dma_registers
 * @defgroup DMA_CTRL DMA_CTRL
 * @brief    DMA Channel Control Register.
 * @{
 */
 #define MXC_F_DMA_REVA_CTRL_EN_POS                          0 /**< CTRL_EN Position */
 #define MXC_F_DMA_REVA_CTRL_EN                              ((uint32_t)(0x1UL << MXC_F_DMA_REVA_CTRL_EN_POS)) /**< CTRL_EN Mask */

 #define MXC_F_DMA_REVA_CTRL_RLDEN_POS                       1 /**< CTRL_RLDEN Position */
 #define MXC_F_DMA_REVA_CTRL_RLDEN                           ((uint32_t)(0x1UL << MXC_F_DMA_REVA_CTRL_RLDEN_POS)) /**< CTRL_RLDEN Mask */

 #define MXC_F_DMA_REVA_CTRL_PRI_POS                         2 /**< CTRL_PRI Position */
 #define MXC_F_DMA_REVA_CTRL_PRI                             ((uint32_t)(0x3UL << MXC_F_DMA_REVA_CTRL_PRI_POS)) /**< CTRL_PRI Mask */
 #define MXC_V_DMA_REVA_CTRL_PRI_HIGH                        ((uint32_t)0x0UL) /**< CTRL_PRI_HIGH Value */
 #define MXC_S_DMA_REVA_CTRL_PRI_HIGH                        (MXC_V_DMA_REVA_CTRL_PRI_HIGH << MXC_F_DMA_REVA_CTRL_PRI_POS) /**< CTRL_PRI_HIGH Setting */
 #define MXC_V_DMA_REVA_CTRL_PRI_MEDHIGH                     ((uint32_t)0x1UL) /**< CTRL_PRI_MEDHIGH Value */
 #define MXC_S_DMA_REVA_CTRL_PRI_MEDHIGH                     (MXC_V_DMA_REVA_CTRL_PRI_MEDHIGH << MXC_F_DMA_REVA_CTRL_PRI_POS) /**< CTRL_PRI_MEDHIGH Setting */
 #define MXC_V_DMA_REVA_CTRL_PRI_MEDLOW                      ((uint32_t)0x2UL) /**< CTRL_PRI_MEDLOW Value */
 #define MXC_S_DMA_REVA_CTRL_PRI_MEDLOW                      (MXC_V_DMA_REVA_CTRL_PRI_MEDLOW << MXC_F_DMA_REVA_CTRL_PRI_POS) /**< CTRL_PRI_MEDLOW Setting */
 #define MXC_V_DMA_REVA_CTRL_PRI_LOW                         ((uint32_t)0x3UL) /**< CTRL_PRI_LOW Value */
 #define MXC_S_DMA_REVA_CTRL_PRI_LOW                         (MXC_V_DMA_REVA_CTRL_PRI_LOW << MXC_F_DMA_REVA_CTRL_PRI_POS) /**< CTRL_PRI_LOW Setting */

